Repository: BeSpiral/backend
Catalog: priv/gettext/amh-ETH/LC_MESSAGES/default.po
Languages: amh_eth

source: , here is your reward
amh_eth: ሽልማትህ ይህ ነው።

source: Go to app
amh_eth: ወደ መተግበሪያ ይሂዱ

source: Hello
amh_eth: ሰላም

source: Hey, you received
amh_eth: ሄይ ተቀብለሃል

source: More on app
amh_eth: በመተግበሪያው ላይ ተጨማሪ

source: Thanks for your contribution on
amh_eth: ላደረጉት አስተዋፅዖ እናመሰግናለን

source: You received
amh_eth: ተቀብለሃል

source: You received a new transfer on
amh_eth: በ ላይ አዲስ ዝውውር ተቀብለዋል።

source: Your claim was approved!
amh_eth: የይገባኛል ጥያቄዎ ጸድቋል!

source: more details on app.
amh_eth: በመተግበሪያው ላይ ተጨማሪ ዝርዝሮች.

source: Sent by
amh_eth: የተላከው በ

source: at
amh_eth: በ

source: During this month we've released some news in the app, and so you don't miss any of them, we've prepared a super summary!
amh_eth: በዚህ ወር በመተግበሪያው ውስጥ አንዳንድ ዜናዎችን አውጥተናል፣ እና አንዳቸውም እንዳያመልጥዎ፣ እጅግ በጣም ጥሩ ማጠቃለያ አዘጋጅተናል!

source: Go to community
amh_eth: ወደ ማህበረሰብ ሂድ

source: Newsletter
amh_eth: ጋዜጣ

source: See the latest news
amh_eth: የቅርብ ዜናዎችን ይመልከቱ

source: Want to stop receiving these emails?
amh_eth: እነዚህን ኢሜይሎች መቀበል ማቆም ይፈልጋሉ?

source: You are receiving this email because you signed up for Cambiatus or
amh_eth: ይህ ኢሜይል የደረሰዎት ለካምቢያተስ ስለተመዘገቡ ነው።

source: You can unsubscribe by
amh_eth: ከደንበኝነት ምዝገባ መውጣት ትችላለህ

source: a company that uses the Cambiatus platform.
amh_eth: የካምቢያተስ መድረክን የሚጠቀም ኩባንያ.

source: clicking here
amh_eth: እዚህ ጠቅ ማድረግ

source: Community News
amh_eth: የማህበረሰብ ዜና

source: Sold by
amh_eth: የተሸጠው በ

source: makes part of Cambiatus
amh_eth: የካምቢያተስ አካል ያደርጋል

source: Which mailing list do you wish to unsubscribe from?
amh_eth: ከየትኛው የደብዳቤ መላኪያ ዝርዝር ከደንበኝነት ምዝገባ መውጣት ይፈልጋሉ?

source: Claim Notification
amh_eth: የይገባኛል ጥያቄ ማስታወቂያ

source: Transfer notification
amh_eth: ማሳወቂያ ማስተላለፍ

source: Monthly news about the community
amh_eth: ስለ ማህበረሰቡ ወርሃዊ ዜና

source: Submit
amh_eth: አስገባ

source: enabled
amh_eth: ተችሏል

source: disabled
amh_eth: አልተቻለም

source: Preferences updated successfully!
amh_eth: ምርጫዎች በተሳካ ሁኔታ ተዘምነዋል!

source: Something went wrong. Please try again.
amh_eth: የሆነ ስህተት ተከስቷል. እባክዎ ዳግም ይሞክሩ.

source: Hello,
amh_eth: ሰላም
